Terraform Version:

```sh
> terraform version
Terraform v1.4.2
on linux_amd64
+ provider registry.terraform.io/hashicorp/local v2.4.0
```

I've also been battling this issue since terraform 1.4.0 was released. There is an inconsistency with how terraform is handling sensitive input values in a root module vs. in a child module. I've created a repo that demonstrates the issue as concisely as possible, though my real use case is far more intricate.

This terraform stack creates a mock AWS EC2 instance, using entirely local values. The important point is that the module has an input variable that is marked `sensitive = true`. In the example below, the root module passes a `key_name` (`sensitive = false`) and a `bootstrap_token` (`sensitive = true`) into the module call. The module uses the token to construct an `user_data` object. The module then returns the objects that were created as outputs.

```sh
# clone the demo repo
git clone https://github.com/freakinhippie/terraform-bug-reports.git
# move into the repo and checkout the appropriate revision
cd terraform-bug-reports/
git checkout terraform-32880
# move into the stack directory to illustrate the error
cd stacks/error_with_module/
# run terraform
terraform init
terraform apply
```

The root module:

```terraform
# cat ./stacks/error_with_module/*.tf

module "host" {
  source = "../../modules/mock_ec2_instance"

  instances       = var.instances
  bootstrap_token = var.bootstrap_token
}

locals {
  unique_keys = { for k in toset(module.host.instances[*].key_name) : k => true }
}

resource "local_sensitive_file" "keys" {
  for_each = local.unique_keys

  filename        = "${path.module}/${each.key}"
  content         = each.value
  file_permission = "0600"
}

variable "bootstrap_token" {
  type      = string
  sensitive = true
  default   = ""
}

variable "instances" {
  description = "List of instance meta-data objects"
  type = list(object({
    name     = string
    key_name = string
  }))
}

terraform {
  required_version = ">= 1.4"
}
```

The child module:

```terraform
# cat ./modules/mock_ec2_instance/*.tf

# mock ec2 instance to demonstrate issue
locals {
  instances = [
    for i, v in var.instances : merge(
      v,
      {
        user_data = "# ${var.bootstrap_token}"
      }
    )
  ]
}

output "instances" {
  value = local.instances
}

variable "bootstrap_token" {
  type      = string
  sensitive = true
  default   = ""
}

variable "instances" {
  description = "List of instance meta-data objects"
  type = list(object({
    name     = string
    key_name = string
  }))
}

terraform {
  required_version = ">= 1.4"
}
```

Attempting to apply this configuration with terraform 1.4.0 or greater results in the following error:

```sh
> terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.keys["my-ec2-key"] will be created
  + resource "local_sensitive_file" "keys" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "./my-ec2-key"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid for_each argument
│ 
│   on main.tf line 13, in resource "local_sensitive_file" "keys":
│   13:   for_each = local.unique_keys
│     ├────────────────
│     │ local.unique_keys has a sensitive value
│ 
│ Sensitive values, or values derived from sensitive values, cannot be used as for_each arguments. If used, the sensitive value could be exposed as a resource instance key.

```

The problem arises from the `bootstrap_token` input variable within the `ec2_instance` module. It is marked as `sensitive = true` and therefore the `module.host.instances[*].user_data` is presumably also marked as sensitive. The sensitive flag is passed back in the output where it ultimately results in the error shown above.

In my scenario I have no need to use the sensitive `user_data` value in a `for_each` statement. I **do** need the `key_name` value though.

In an attempt to mitigate the issue, I tried changing the `unique_keys` local value to use the `nonsensitive()` function like so (as well as every other permutation of `nonsensitive()` I could think of):

```terraform
locals {
  unique_keys = { for k in toset(nonsensitive(module.host.instances[*].key_name)) : k => true }
}
```

But that results in a new error:

```sh
Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Invalid function argument
│ 
│   on main.tf line 77, in locals:
│   77:   unique_keys = { for k in toset(nonsensitive(module.host.instances[*].key_name)) : k => true }
│     ├────────────────
│     │ while calling nonsensitive(value)
│     │ module.host.instances is tuple with 1 element
│ 
│ Invalid value for "value" parameter: the given value is not sensitive, so
│ this call is redundant.
╵
```

Incidentally, the original error which said `"If used, the sensitive value could be exposed as a resource instance key."`, that ship had already sailed because the planning output includes:

```sh
# SNIP
Terraform will perform the following actions:

  # local_sensitive_file.keys["my-ec2-key"] will be created
  + resource "local_sensitive_file" "keys" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "./my-ec2-key"
      + id                   = (known after apply)
    } 
# SNIP
```

In trying to simplify the use case enough to submit a meaningful bug report I found that if I move all of the logic from the `ec2_instance` child module into the root module, _including the sensitive input variable `bootstrap_token`_, I do not encounter the problem.

```sh
# move into the stack directory to illustrate the error
cd stacks/no_error_in_root/
# run terraform
terraform init
terraform apply
```

```terraform
# cat ./stacks/no_error_in_root/*.tf

locals {
  instances = [
    for i, v in var.instances : merge(
      v,
      {
        user_data = "# ${var.bootstrap_token}"
      }
    )
  ]
  unique_keys = { for k in toset(local.instances[*].key_name) : k => true }
}

resource "local_sensitive_file" "keys" {
  for_each = local.unique_keys

  filename        = "${path.module}/${each.key}"
  content         = each.value
  file_permission = "0600"
}

variable "bootstrap_token" {
  type      = string
  sensitive = true
  default   = ""
}

variable "instances" {
  description = "List of instance meta-data objects"
  type = list(object({
    name     = string
    key_name = string
  }))
}

terraform {
  required_version = ">= 1.4"
}
```

I cannot say if this is a bug or not, but the inconsistent operation when operating at the root module level vs using a child module suggest a bug.

Any suggestions for a work-around, other than moving module logic into the root module would be very much appreciated!

Thank you!
